-- phpMyAdmin SQL Dump
-- version 4.9.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Jan 12, 2023 at 04:09 AM
-- Server version: 8.0.17
-- PHP Version: 7.3.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `testdb`
--

-- --------------------------------------------------------

--
-- Table structure for table `minor_depart`
--

CREATE TABLE `minor_depart` (
  `minor_id` varchar(20) NOT NULL,
  `minor_name` varchar(60) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `depart_name` varchar(80) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `minor_depart`
--

INSERT INTO `minor_depart` (`minor_id`, `minor_name`, `depart_name`) VALUES
('59210601', 'ก่อสร้าง', 'แผนกวิชาช่างก่อสร้าง'),
('60210301', 'ผลิตภัณฑ์', 'แผนกวิชาช่างเชื่อมโลหะ'),
('60310801', 'เทคนิคสถาปัตยกรรม', 'แผนกวิชาเทคนิคสถาปัตยกรรม'),
('60311102', 'ติดตั้งและบำรุงรักษา', 'แผนกวิชาช่างเทคนิคอุตสาหกรรม'),
('61210201', 'เครื่องมือกล', 'แผนกวิชาช่างกลโรงงาน'),
('61210801', 'สถาปัตยกรรม', 'แผนกวิชาเทคนิคสถาปัตยกรรม'),
('61212801', 'เทคนิคคอมพิวเตอร์', 'แผนกวิชาช่างอิเล็กทรอนิกส์'),
('61220401', 'คอมพิวเตอร์ธุรกิจ', 'แผนกวิชาเทคโนโลยีสารสนเทศ'),
('61310502', 'อิเล็กทรอนิกส์อุตสาหกรรม', 'แผนกวิชาช่างอิเล็กทรอนิกส์'),
('622010106', 'ยานยนต์', 'แผนกวิชาช่างยนต์'),
('622010205', 'แม่พิมพ์โลหะ', 'แผนกวิชาช่างกลโรงงาน'),
('622010404', 'ไฟฟ้ากำลัง', 'แผนกวิชาช่างไฟฟ้ากำลัง'),
('622010502', 'อิเล็กทรอนิกส์', 'แผนกวิชาช่างอิเล็กทรอนิกส์'),
('622011001', 'เขียนแบบเครื่องกล', 'แผนกวิชาเขียนแบบเครื่องกล'),
('622011101', 'ซ่อมบำรุงอุตสาหกรรม', 'แผนกวิชาช่างเทคนิคอุตสาหกรรม'),
('622012702', 'เมคคาทรอนิกส์', 'แผนกวิชาช่างเมคคาทรอนิกส์'),
('622090101', 'การโปรแกรมคอมพิวเตอร์ เว็บ และอุปกรณ์เคลื่อนที่', 'แผนกวิชาเทคโนโลยีสารสนเทศ'),
('62310102', 'เทคนิคยานยนต์', 'แผนกวิชาช่างยนต์'),
('62310204', 'ผลิตชิ้นส่วนยานยนต์', 'แผนกวิชาช่างกลโรงงาน'),
('62313801', 'เทคนิคควบคุมและซ่อมบำรุงระบบขนส่งทางราง', 'แผนกวิชาช่างเทคนิคควบคุม และซ่อมบำรุงระบบขนส่งทางราง'),
('633010105', 'เทคนิคยานยนต์ไฟฟ้า', 'แผนกวิชาช่างยนต์'),
('633010301', 'เทคโนโลยีงานเชื่อมและขึ้นรูปผลิตภัณฑ์โลหะ', 'แผนกวิชาช่างเชื่อมโลหะ'),
('633011001', 'ออกแบบและเขียนแบบการผลิต', 'แผนกวิชาเขียนแบบเครื่องกล'),
('633011101', 'เทคโนโลยีวิศวกรรมซ่อมบำรุงอุตสาหกรรม', 'แผนกวิชาช่างเทคนิคอุตสาหกรรม'),
('633012701', 'เมคคาทรอนิกส์และหุ่นยนต์', 'แผนกวิชาช่างเมคคาทรอนิกส์'),
('633012801', 'คอมพิวเตอร์มัลติมีเดีย', 'แผนกวิชาช่างอิเล็กทรอนิกส์'),
('633013801', 'ซ่อมบำรุงระบบอาณัติสัญญาณและโทรคมนาคม', 'แผนกวิชาช่างเทคนิคควบคุม และซ่อมบำรุงระบบขนส่งทางราง'),
('633013803', 'ซ่อมบำรุงทางวิ่งรถไฟ', 'แผนกวิชาช่างเทคนิคควบคุม และซ่อมบำรุงระบบขนส่งทางราง'),
('633021401', 'การจัดการเทคโนโลยีโลจิสติกส์', 'แผนกวิชาโลจิสติกส์'),
('633090101', 'นักพัฒนาซอฟต์แวร์คอมพิวเตอร์', 'แผนกวิชาเทคโนโลยีสารสนเทศ'),
('643010302', 'ตรวจสอบและทดสอบงานเชื่อม', 'แผนกวิชาช่างเชื่อมโลหะ');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `minor_depart`
--
ALTER TABLE `minor_depart`
  ADD PRIMARY KEY (`minor_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
